Revit 2026 API

# RevitLinkOperations Properties

---

The RevitLinkOperations type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LinkOperations) |

#### Reference

RevitLinkOperations Class

Autodesk.Revit.DB Namespace